#include <iostream>
#include <string>
#include <vector>
#include <algorithm>

using namespace std;

/*Створити новий С++ проєкт, описати карказ роєкту(бібліотеки, головну функцію) 
    -Ствоприти віддалений репозиторій 
    - Запушити проєкт на віддалений сервер 
    По функціональності: 
    -Клас фігура(Вектор з точок) 
    - Створити декілька фігур, вивести на екран у мейні. 
    - Створити хоча 5 комітів 
    Пізніше до функціоналу додати: 
    -Клас фігура - абстрактний чисто віртуальний метод прінт 
    -4 похідні класи фігур 
    - в мейні створити масив з різних фігур і вивести інформацію про них.*/


class figure {
    vector<string> points;
public:
    figure() : points('*') {}

};


int main() {



	return 0;
}